{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 1, 28], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [28], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [4732, 128], "name": "dense_7/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_7/bias"}, {"dtype": "float32", "shape": [128, 10], "name": "dense_8/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense_8/bias"}]}], "modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "sparse_categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 28, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_7", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_8", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_4"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "format": "layers-model"}